Show / Hide Table of Contents
Interface IBIMPluginClient<T>
Responsible for controlling the connected BIM application to IS
Namespace: IdeaStatiCa.Plugin
Assembly: IdeaStatiCa.Plugin.dll
Syntax
public interface IBIMPluginClient<T>
Type Parameters
 Name |  Description
 T
Type of the plugin's service contract
Properties
Improve this Doc   View Source
MyBIM
Used for calling methods of connected BIM application
Declaration
T MyBIM { get; }
Property Value
 Type |  Description
 T
Improve this Doc   View Source
Status
Get status of the BIM application
Declaration
AutomationStatus Status { get; }
Property Value
 Type |  Description
 AutomationStatus
Methods
Improve this Doc   View Source
RunAsync(String)
Starts BIM application
Declaration
Task RunAsync(string id)
Parameters
 Type |  Name |  Description
 System.String |  id
Identified of
Returns
 Type |  Description
 System.Threading.Tasks.Task
Improve this Doc   View Source
Stop()
Stops BIM application
Declaration
void Stop()
Events
Improve this Doc   View Source
BIMStatusChanged
Notification about events in the connected BIM application
Declaration
event ISEventHandler BIMStatusChanged
Event Type
 Type |  Description
 ISEventHandler
 Improve this Doc
 View Source